[
  {
    "text": "\"I am getting calls from a Chinese sounding voice and it has amounted to 25 different numbers which I have been blocking each time I receive them is there any way that you can stop these very annoying calls please. I do know of another person on PlusNet that is receiving to same calls\"",
    "created_at": "\"2018-08-21 12:34:02\"",
    "service_id": "53014",
    "category_id": "249"
  },
  {
    "text": "\"I had a mobile account from July 2012 to Jul 2014. My account was in credit when I cancelled my contract, but I have never received a refund.\"",
    "created_at": "\"2018-08-29 14:03:41\"",
    "service_id": "409",
    "category_id": "63"
  },
  {
    "text": "\"Charging me double for my iPad Pro tariff. I have added my sky mobile number as my account number owing to sky deliberately preventing me from logging on to my account and providing my account number. \"",
    "created_at": "\"2018-08-24 06:11:06\"",
    "service_id": "53785",
    "category_id": "63"
  },
  {
    "text": "\"19 August unfortunately balances cuts to make 1p balance maybe overcharged can you check and refund my balance please \"",
    "created_at": "\"2018-08-23 17:30:34\"",
    "service_id": "349",
    "category_id": "249"
  },
  {
    "text": "\"Hi I have phoned to make a claim about my hwaui p20 pro which is not charging. I got through to honestly the most unpleasant man I have ever spoken to who after not being very helpful informed me that the phone I am contacting him about is out of stock and he couldn't tell me when it would be back in stock. He offered me 2 or 3 phones of alot lesser value which is ridiculous considering I specifically chose that phone for a reason when purchasing so now I'm left in limbo knowing nothing \"",
    "created_at": "\"2018-09-05 11:54:58\"",
    "service_id": "399",
    "category_id": "67"
  },
  {
    "text": "\"When I originally took out the contract I was promised entertainment pack with my package for free like now tv and prime video. but I never got this package add on for free as part of the deal. I have spend several times on chat but they are unable to help and keep disconnecting me and saying they cannot find the notes which said I was promised this.\"",
    "created_at": "\"2018-09-06 13:06:06\"",
    "service_id": "620",
    "category_id": "72"
  },
  {
    "text": "\"I have been asked to swap onto a new SIM, which i received in the post The date for the swap was arranged and my old sim lost signal as expected. However, my new sim did not connect. After waiting for over 24 hours i contacted the customer services number to be told that the wrong sim had been activated with my number (apparently it was sent to me in the post but i didnt receive it). I asked for the sim that i had been sent to be activated instead only to be told that this was not possible and i would have to be sent ANOTHER sim that will take another 3 - 5 days to arrive. I am not happy that i am paying for a service that i can not not use for a week because i was sent the wrong sim, never mid the fact that i will be unable to make or receive phone calls or messages until this new sim is received and activated.\"",
    "created_at": "\"2018-09-04 12:28:58\"",
    "service_id": "51870",
    "category_id": "72"
  },
  {
    "text": "\"I purchased android phone outright September 2017. When I tried to change provider, I was told that the handset was locked . When I got my PAC I was not told the phone was locked or that it would take up to 7 days to be unlocked. I then rang to unlock my phone I was told it would be up to 24 hrs to get an unlock code and then 3 days to unlock. Now i have been told that it could take up to 7 days cos my phone is android not iphone, even though o2 knew that when I phoned previously. I asked to speak to a manager . They refused saying I had to wait for a manager callback, IF the manager agreed to make that call and that call back would be anytime within the next 24 hours. I am amazed the company can lock a phone they dont own and never have done on a network I am no longer using. I need the phone as I am trying to support a friend who is going through chemo and I need to be in communication but cant be when out. I feel so frustrated. After saying this wasnt good enough, o2 say the arliest they can unlock my phone is 4 working days. \"",
    "created_at": "\"2018-09-06 08:28:36\"",
    "service_id": "15708",
    "category_id": "67"
  },
  {
    "text": "\"I currently have an overdue bill of 85 pound which I can pay on monday but I always have extra charges on my bill. Every month it is different and I can't afford it sometimes. My account has been suspended and I have noticed on my next payment I am due near enough 600 plus my usual amount. I have no way of paying this off. I don't think it's fair to run a bill so high and over charge. \"",
    "created_at": "\"2018-08-23 03:24:37\"",
    "service_id": "218",
    "category_id": "63"
  },
  {
    "text": "\"I have recently ordered a SIM for use on OS monthly contract, however you have raised a bill today for use from 31/8/2018, however I have not received the SIM yet or connected to your network.\"",
    "created_at": "\"2018-09-04 13:05:38\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"I'd like to raise a complaint regarding being contacted an inappropriate amount of times by your customer services. Over 6 days, I was called 5 times (sometimes more than once per day); presumably regarding upgrading my plan as I am now out of contract. My understanding, having worked in the communications sector, is that Ofcom provides guidelines regarding the amount of times that it is appropriate to call someone. I have also received numerous text messages throughout this time period from O2. I would understand if I had missed a payment or something urgent had happened on my account, but the fact that I am being constantly called despite being nothing but loyal to O2 throughout this time has really changed my impression of the company. I understand that O2 want to contact me to let me know about upgrade offers, but I feel that contacting someone this many times over a short time period is inappropriate and unnecessarily distressing. I have been with O2 for two years now and am seriously considering not renewing my contract, as I am severely disappointed and upset by this.\"",
    "created_at": "\"2018-08-28 00:05:05\"",
    "service_id": "399",
    "category_id": "71"
  },
  {
    "text": "\"I have purchased o2 monthly contract on 04/08 however I have cancelled it next day due to received a good offer from my current mobile provider. O2 keep emailing me that I am own them money even though I have cancelled the order on next day and the phone was never received and send back to the provider. They keep harassing me with their emails. I have first contacted them on 09/08 ( after I was emailed I am owned them money) and I was advised the account is closed and there is nothing to pay. They even sent me a confirmation email. Then they emailed me on 21/08 to say I am own them outstanding balance. I was then in Poland on my holiday. I called them but the girl over the phone didn't know what she was doing and hung up. Then they took money from my account on 23/08. I called them again while I was in Poland, they answered mu call after 30 min !!!!! after one hour conversation I was told everything is sorted. It wasn't as they emailed me next day to say I am still own them money. \"",
    "created_at": "\"2018-08-28 13:20:19\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"I have just checked why my bills were so high and turns out i have been paying for a non existent extra account for 2 years\"",
    "created_at": "\"2018-08-28 11:33:15\"",
    "service_id": "620",
    "category_id": "63"
  },
  {
    "text": "\"i am no longer an o2 customer. o2 keep sending me emails saying i owe them money. i do not. when i call or use web chat they admit there is a mistake. i still keep getting threatening emails from o2.\"",
    "created_at": "\"2018-08-23 15:59:25\"",
    "service_id": "15708",
    "category_id": "63"
  },
  {
    "text": "\"I have been working in Keswick over the last couple of weeks and the signal there (previously fine) is now atrocious!! I am told by the locals that the problem is due to a conflict between United Utilities equipment and EEs masks, basically there is a crane blocking signals between the relay masts.... I have bought another PAYG phone on Vodafone which works fine, but this is hardly the solution.\"",
    "created_at": "\"2018-08-27 11:13:34\"",
    "service_id": "218",
    "category_id": "69"
  },
  {
    "text": "\"My brother was visiting the UK and a had a temporary giffguff pay as you go sim. We bought credit once with my card. He is gone back since the beginning of June but I can see that money has been taken off my account while he is no longer using the sim and no direct debit was set up.\"",
    "created_at": "\"2018-08-31 11:20:42\"",
    "service_id": "252",
    "category_id": "63"
  },
  {
    "text": "\"Please read the pages of documents you have linked to this phone number and you will see the problem. In addition to this I am appalled that I was put on hold to talk to a manager for 1 1/2 hours and then the line went dead. Also a manager was booked to ring me at 1.00pm and I had no phone call. This is the second time within a month that there has been a problem - see account notes. I have been told only a manager can sort it out but I can't get access to a manager!\"",
    "created_at": "\"2018-09-01 14:24:53\"",
    "service_id": "51870",
    "category_id": "63"
  },
  {
    "text": "\"I have recently taken out a 12 month mobile phone contract with Virgin but despite two calls to customer help I still am getting a message on my phone indicating \\\"No Service\\\" although intermittently I do get connected.\"",
    "created_at": "\"2018-08-27 16:58:30\"",
    "service_id": "51870",
    "category_id": "249"
  },
  {
    "text": "\"My ID account has suddenly switched to T Mobile preventing the phone accessing the mobile network - message 'no mobile network' Understand T mobile is part of E-E\"",
    "created_at": "\"2018-08-22 10:22:35\"",
    "service_id": "20564",
    "category_id": "69"
  },
  {
    "text": "\"I phoned today to cancel my account with you as I no longer with to use this phone number as the phone itself is very old. The lady could not cancel my account or direct debit details as I did not know my password for telephone contact. I have now cut up the sim card for the above telephone number. From my on line account I note that I do not owe you any money, and I have cancelled the direct debit. I appreciate that I must inform you about cancelling the direct debit.\"",
    "created_at": "\"2018-08-22 20:35:36\"",
    "service_id": "51870",
    "category_id": "67"
  },
  {
    "text": "\"Currently in New Zealand - have bought a NZ sim card but was keen to keep my O2 UK sim card/number so have been paying the bill without using the phone. Put the UK sim card in my phone for 2 minutes but did not use any data as I was on wifi, did not make any calls or send texts. However, I have been charged the daily rate of using O2 Travel which I do not understand as I have not used any services.\"",
    "created_at": "\"2018-09-03 01:03:22\"",
    "service_id": "399",
    "category_id": "68"
  },
  {
    "text": "\"I have complained numerous times that the signal has been extremely poor, and unable to use my phone. They did promise a free booster box , but then I was told I had to buy one. Also in the past my phone bill has been very high \"",
    "created_at": "\"2018-08-22 18:05:38\"",
    "service_id": "620",
    "category_id": "69"
  },
  {
    "text": "\"I been unable to find a number to get in contact. My number has been cut off without any communication being sent to me again. This is the second time this has happened.\"",
    "created_at": "\"2018-08-22 18:18:15\"",
    "service_id": "218",
    "category_id": "249"
  },
  {
    "text": "\"Started new contract got new handset. Used o2 recycle and phone was lost. Money paid via post office insurance now been charged for not sending phone. \"",
    "created_at": "\"2018-09-05 21:27:21\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"I lost my mobile three months ago and with all the hassle I had with trying to renovate my home and having mental health issues I didn't/forgot to cancel the sim . When I did after I saw the paper bill I explained my situation multiple times to multiple people so called customer service as a gesture of good will and being a loyal customer for many decades to wave this bill as I never used the tariff that they had suspended and can't use but they're still charging me. After coming to an agreement eventually they kept giving me the tactical run around saying that there was no notes on this agreement and kept charging me when I said to cancel the sim till someone contacts me who does not go back on an agreement and does there job for a long standing customer. \"",
    "created_at": "\"2018-08-25 20:29:22\"",
    "service_id": "51870",
    "category_id": "71"
  },
  {
    "text": "\"I am writing concerning delivery of my upgrade phone, which was due to arrive today. As per the emails I had received I was expecting the parcel to arrive between 14:14 and 15:14 pm. I was tracking the parcel via the app and could see that the driver was a minute or two away from my address on several occasions. The delivery slot came and went. I continued tracking and could see that the driver was still very near my addresses, in various locations.\"",
    "created_at": "\"2018-08-30 19:10:54\"",
    "service_id": "20881",
    "category_id": "770"
  },
  {
    "text": "\"Calls cutting off/ cannot hear the person on the other side. Calls not connecting. Crackling sounds on phonecalls\"",
    "created_at": "\"2018-09-09 21:47:13\"",
    "service_id": "399",
    "category_id": "69"
  },
  {
    "text": "\"I bought a Vodafone sim card in Budapest, Hungary. The sim card still works in other countries I just don't know how to put more credit for data on it.\"",
    "created_at": "\"2018-09-02 11:41:46\"",
    "service_id": "620",
    "category_id": "770"
  },
  {
    "text": "\"I forgot to reacharge my mobile number and my number has turned invalid from yesterday but i want the sane number, i has been actively using it in india and like to continie your network service\"",
    "created_at": "\"2018-08-25 11:44:31\"",
    "service_id": "620",
    "category_id": "63"
  },
  {
    "text": "\"I ordered a refurbished phone which was in received perfect condition. However I did not get a charger , just a cable. How am I to charge the phone when I dont have a usb pc near me? Surely as a minimum, the charger should be supplied?\"",
    "created_at": "\"2018-08-23 05:00:14\"",
    "service_id": "15708",
    "category_id": "770"
  },
  {
    "text": "\"On the 1st of august 2018 I settled my phone account. My concern is that I have not had any confirmation of termination and payment to said account. \"",
    "created_at": "\"2018-08-30 14:00:45\"",
    "service_id": "399",
    "category_id": "70"
  },
  {
    "text": "\"Each time I try to get my proof of purchase from O2, the compan6 sends me details of the incorrect iPad. O2 repeatedly send me a proof of purchase email which states that I have an iPad Pro 9.7, but I am paying for an iPad Pro 10.5, and trade my old iPad (the 9.7) in with O2 on 13 July 2018 as part of the O2 refresh programme. I now have no confidence that I have the right iPad, and am unable to provide proof of purchase for my insurance company. \"",
    "created_at": "\"2018-09-02 22:05:00\"",
    "service_id": "399",
    "category_id": "71"
  },
  {
    "text": "\"I have called over the last two nights and estimated being on the phone, mainly trying to get through to an agent, for over an hour and a half. On all four calls I have been cut off. Despite requesting a callback and being told I would get one , NOBODY has called me back. This is causing me anxiety and I am going to leave virgin mobile and media if I do not receive a callback within 24 hours. This is totally unacceptable. \"",
    "created_at": "\"2018-08-21 20:01:50\"",
    "service_id": "51870",
    "category_id": "71"
  },
  {
    "text": "\"I left O2 and moved to another network on 7 June. Since then I have continued to receive texts from O2, Os more and O2 priority. I have replied to the number stating stop which has done nothing. I rang customer services who removed me from the mailing list which worked for a month but I am now receiving the messages again. I cannot opt out of it as my O2 account has been shut. \"",
    "created_at": "\"2018-08-31 11:30:15\"",
    "service_id": "399",
    "category_id": "249"
  },
  {
    "text": "\"Never received the deadlock letter. Spoke to fraud department and was informed it would not be reissued. I called the ombudsmen who inform me that as I have not received it they are duty bound to reissue it\"",
    "created_at": "\"2018-08-21 19:07:34\"",
    "service_id": "620",
    "category_id": "249"
  },
  {
    "text": "\"I missed a call of a number I didn't recognise so I rang it back and got straight through to an o2 operator, It started all well asking how I'm finding my mobile phone and why I chose this model etc, Then he( didn't catch his name) started saying because I'm a o2 loyal customer I should be rewarded, I were like OK, He then told me about a product that were being offered to others at 20 pounds a month but to me I could have it for a reduced price of 12 pounds a month, After a while how the conversation were going I thought he thinks I'm agreeing to this so I told him, I'm not signing upto anything yet, He were taken back and said oh I thought you were, I said no, I told him money were tight at moment and he were sympathetic then still tried to sell mi the product, I again said let me think about it, he again repeated that its a great offer and what is there to think about, Again I said let me go away and think about it, he said again what is there to think about as its a great offer, In the end I said you are forcing me to make a decision and am not happy about this, I had to put phone down as I were getting angry and annoyed by his tactics, I'm very disappointed to be honest, It were on Thursday 30 the August at around 10.40am I hope you will be able to listen to the recording, Thank you \"",
    "created_at": "\"2018-09-02 09:45:19\"",
    "service_id": "399",
    "category_id": "249"
  },
  {
    "text": "\"you have a mast that is not working for at least a month and I can not get any phone calls or text on a nokia 105, this is becoming an issue now as the phone is for my son as he walks to and from school. There is not a problem with the phone or the sim so it can only be your network as the phone works on Virgin and Tesco networks when I change the sim. All our other O2 business phones work in our house and the close proximity \"",
    "created_at": "\"2018-08-31 08:12:43\"",
    "service_id": "399",
    "category_id": "69"
  },
  {
    "text": "\"just topped up $105 on 8/24/18- but it expires on 11/24/18-thats not enough time to use up this amount of $ in past when i topped up $100 or more the time was good for 1 year from date of top up it i knew i was only going to get such a short time i would have only topped up $40-$50 why did you do this-i need more time or i would like to get partial refund\"",
    "created_at": "\"2018-08-27 22:02:26\"",
    "service_id": "51870",
    "category_id": "71"
  },
  {
    "text": "\"I own an iphone X, which came with one free screen replacement. I recently used said replacement and the replacement phone is lightly scratched around the entire silver edging. The handset I replaced was not scratched in this area and I am not satisfied that this is a suitable replacement. I understand you give out refurbished phones, but I was under the impression they were grade A only. I need my phone for work and it is a massive inconvenience to keep having to wipe it and set up a new one, two hours of my day were lost yesterday as the new phone I received was also completely dead and therefore could not be used. \"",
    "created_at": "\"2018-08-29 08:06:23\"",
    "service_id": "399",
    "category_id": "67"
  },
  {
    "text": "\"I am a pay-monthly business customer with two sim-only lines. As part of our plan we had access to London Underground WiFi. However, when our price plans were changed a few months ago the access to the service was taken away without notice. Speaking to a vodafone customer service person I've been told that it's being phased out and replaced with another service, but it isn't due to go live until March 2019. So our plan has been 'downgraded' without a viable alternative. This goes against the information on their website saying that any pay-monthly customer with a data plan or any business customer has access to the service. I fit both of those criteria yet I don't have access, so it's false advertising.\"",
    "created_at": "\"2018-08-23 10:54:42\"",
    "service_id": "620",
    "category_id": "72"
  },
  {
    "text": "\"I have raised this issue several times with o2, even raising a complaint however they have failed to deal with this issue or even respond formally. Before taking out my contract with o2, I was advised that my property and surrounding areas were good coverage areas however since taking out the contract, I have absolutely no signal in my home. I have been told that improvement works will fix this however I still have no signal. If I had known this would be the case, I would not have taken out the contact with o2.\"",
    "created_at": "\"2018-09-04 10:53:52\"",
    "service_id": "399",
    "category_id": "69"
  },
  {
    "text": "\"I discovered an adverse credit report from 2013 with a debit balance. My mortgage has been refused .I have never been in default, I had had one phone contract that worked but O2 acted wrongly on another contract - chasing me (after a long delay) for a balance for broadband when they had never provided a service and their rep had cancelled the contract and taken return of equipment immediately because of lack of coverage; debt collectors were instructed who refused to proceed for O2 and when I chased O2 was told years ago (by a very nasty O2 rep) that while he accepted no money was due I would regret it. The only phone contract i can think of was my son's, that i entered for him i can't remember the provider, but he cancelled that at the shop and by the date of \\\" default\\\" shown had been in Africa for two years. I think the date of \\\"defaul\\\" might be a date I was looking at my bank account and cancelled a direct debit to O2 that should have been dormant for years\"",
    "created_at": "\"2018-08-24 15:59:26\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"I entered into a loan contract with Giffgaff on the 21st of August 2018 to which I took out an iPhone X to be payed in installments. On arrival of the phone on the 22nd, as it was received by a member of my household while I was at work. I got home at night and set up the phone accordingly, on the morning of the 23rd on my way to work I discovered a water mark on the phone and contacted giffgaff, they were prompt to respond to my query and set me up to book a replacement which I did. I sent my phone back on Friday 24th as I had all the packaging at home. There was a bank holiday on the 27th so I had to arranged for the phone to be returned to giffgaff's return centre on the 28th. Royal mail has confirmed its delivery and signing for on the early morning of 28th but giffgaff still has not acknowledged my delivery till date 29/08/2019. I have since receiving the phone requested for my PAC code from my previous provider and moved to giffgaff now I have my contract already rolling without phone usage. They quote it will take 5 working days for them to even contact me if my return is 'accepted', that will be the 5th of September. I am completely livid and do not understand why I have to wait for so long when all I requested was a replacement for the faulty phone sent to me.\"",
    "created_at": "\"2018-08-30 14:33:19\"",
    "service_id": "252",
    "category_id": "67"
  },
  {
    "text": "\"Every single time I have spoken to O2 via online chat they ask me the third & fifth letters of my security word. I find this very insecure, asking me the same digits every single time. I then raised my concern with a member of staff asking why O2 does this and she said \\\"we don't, we ask different ones every month\\\". This has not happened at all. I then asked them to explain why I am asked the same ones every time and they replied stating \\\"You can contact us next month and see they've changed\\\". I have contacted in more than one month and been asked the same characters.\"",
    "created_at": "\"2018-08-24 18:09:53\"",
    "service_id": "399",
    "category_id": "71"
  },
  {
    "text": "\"I cancelled my entire BT package on the 20th of May 2018. I have since discovered that one of my family sim cards was not cancelled correctly and continued. This sim belonged to a family member who was unaware that the service had not terminated on the agreed date with BT, and only became aware when their new service provider alerted them to inactivity on their new sim card. I subsequently checked my account and found that I have been getting billed for this cancelled service for several months. Over the 15th and 16th of August I spent several hours on the phone to BT customer services trying to resolve this, having to call on 3 occasions. I was passed between departments and eventually told I might not get refund due to the sim still being in use, I am still awaiting a response on this. \"",
    "created_at": "\"2018-08-27 20:48:05\"",
    "service_id": "109",
    "category_id": "63"
  },
  {
    "text": "\"I purchased a Samsung s8 when I decided to go with another provider my previous was ee. On looking on the internet I saw the phone i liked so I phoned up to speak about the phone and told the operator that I needed what I was already getting and especially wifi calling as this was important in my job as I work out in the community and also my house doesn't get good coverage whilst indoors and I was assured that the s8 had everything I needed so I purchased it. Since getting my phone i really didn't need the wifi calling to begin with as the signal seemed to get better for awhile but then it started playing up and I was getting missed calls to do with my job and in a few incidents they were emergencies so I went to activate the wifi calling but couldn't find where it was so I went on you tube etc but still didn't help so I got in touch with mobile.co.uk on chat through facebook to be told that my phone doesn't support wifi calling and to get in touch with o2 which I did but they said that they cudnt help me as I purchased the phone from mobile.co.uk so I phone them back and have been basically told that they can't do anything about this.i am furious as I bought my phone from them with the understanding that the phone had everything I needed which it hasn't. I have read forums who have also had this issue and no one helped them either so if either like to cancel my contract without any charges or have my phone replaced with one that supports wifi calling\"",
    "created_at": "\"2018-09-04 11:09:03\"",
    "service_id": "7482",
    "category_id": "67"
  },
  {
    "text": "\"I have been billed by a company called Gamewonderland via my network provider o2. I feel as an o2 customer I have not been protected by these scammers and phoned customer services to see if they could assist me further. They gave me the company's number and email address but after explaining this company does not get back to you as they are scammers I was told just to cancel my d/d. This is not helpful and I do not feel my account has any security. Why bother asking for security questions etc when has been so easy for these people to take money out of my account via an o2 direct debit.\"",
    "created_at": "\"2018-08-25 16:27:35\"",
    "service_id": "399",
    "category_id": "65"
  },
  {
    "text": "\"Apple confirmed manufacturer issue with my iPhone7+ due to upgrade to 11.3 and advised me speak to O2 quoting 2015 Consumer Rights Act. I visited their Birmingham shop on 21/8/18 and was sent away being told that after three months, I had no rights after three months. I spoke to O2 online today to ask for a replacement using wording from Which? and they said they would only offer a repair.\"",
    "created_at": "\"2018-08-27 18:11:10\"",
    "service_id": "399",
    "category_id": "67"
  },
  {
    "text": "\"I have been debited for x 2 SIM cards since 2011 by direct debit. It was only when i cancelled my contract for the one original sim in April 2018. There was an error noted on a second payment from my bank account. I contacted Cusomer Services who agreed to back pay back the money owed in full by cheque on 17th Aug. I received no payment and tried again to resolve this dispute with Customer Service who failed to support with the concerns raised. I am now unable to get a loan because this is on my credit report . Orange have fraudulently taken money from my account since 2011. I agreed to one sim with one mobile number which was also taken out in 2011 and cancelled as above. Please check telephone correspondence to Orange on two occasions 15th August and 23 rd August.\"",
    "created_at": "\"2018-08-28 22:16:30\"",
    "service_id": "409",
    "category_id": "63"
  },
  {
    "text": "\"I have began working at a Hospital since August 1st. I use my phone for my work as well as managing the care of my elderly grandparents. I receive and can make calls but even when I try different areas outside calls cut out frequently, and the other person misses much of what I am saying. I frequently have outages of data connection, on a daily basis there. I have checked the mobile coverage and it does not match what is described, it is far poorer.\"",
    "created_at": "\"2018-09-02 00:51:50\"",
    "service_id": "218",
    "category_id": "69"
  },
  {
    "text": "\"I called on the 2nd of august 2018 to end my contract. Due to the phone been broken and not wanting to upgrade and stay with ID because i have struggled with signal from day one after been advised signal would be fine. I have recently paid a bill and just been sent my bill for September. \"",
    "created_at": "\"2018-08-29 17:41:40\"",
    "service_id": "20564",
    "category_id": "71"
  },
  {
    "text": "\"Hi I would like to tell you i can pay the full amount off my bill on 5 September include next month aswell i couldnt pay last two because i had money problem but all sorted now \"",
    "created_at": "\"2018-08-24 09:26:05\"",
    "service_id": "51870",
    "category_id": "63"
  },
  {
    "text": "\"Since I was sent a new sim (virgin sent the new sim out I did not request a new sim), my coverage is extremely poor. I now pretty much get no signal anywhere, this is increasing becoming a problem as my daughters nursery can never get through to me. \"",
    "created_at": "\"2018-08-30 06:40:41\"",
    "service_id": "51870",
    "category_id": "69"
  },
  {
    "text": "\"I handed in my 30 days termination notice on 10th July. So the line should have been terminated and finished charging on 9th August. However i have just received a bill dated 15th August 2018 and have been charged until the 13th of September. \"",
    "created_at": "\"2018-09-04 15:35:08\"",
    "service_id": "53014",
    "category_id": "63"
  },
  {
    "text": "\"I cancelled 5 December 2016. Regards two contracts free cost they cancelled me. Network problem they gave me free cost. They gave me 30 days notice Is finished 5 January 2017 \"",
    "created_at": "\"2018-08-26 17:05:00\"",
    "service_id": "620",
    "category_id": "65"
  },
  {
    "text": "\"I had a contract for myself and my daughter. I had one month left of contract, after a long conversation on the phone I TOLD THEM I would no longer want to carry on the contract AFTER THIS TIME. However they carried on the contract and stated I OWED 929.93 POUNDS. I have been repaying them VIA PAYMENT PLAN as had letter stating that the account had been taken over by a debt agency. I tried to explain the situation but got no where.\"",
    "created_at": "\"2018-08-27 14:20:36\"",
    "service_id": "620",
    "category_id": "72"
  },
  {
    "text": "\"I received my phone, the Google Pixel 2 XL, in March as part of my upgrade. By month 6 I discovered that the phone has burn in on the front screen, where the menu keys are and where the bar at the top is which holds notification icons and the clock. This is a well known fault, Google have accepted that it is a fault and as such all Google Pixel 2 XL's now have a 2 year warantee. I have spoken to EE regarding this fault and they are stating that they will only repair the phone and not replace it. They say that If I want it replaced I would have to go back to Google to have this done. But my contract is with EE and not with Google as I purchased the phone on contract via EE. Also having already spoken to Google, they state that they will only replace it with a refurbished phone and not a new product.\"",
    "created_at": "\"2018-09-05 12:27:39\"",
    "service_id": "218",
    "category_id": "67"
  },
  {
    "text": "\"I ordered a handset on 29th August 18 which was due to be delivered to my home address DPD did not make the delivery twice when they said they would so I cancelled the order. Having contacted DPD it appears the phone was lost in transit. I contacted the provider to cancel the contract but haven't had any confirmation from EE that the line has been closed. I reordered a further phone on 1st September which was due to be delivered to an EE store on 3rd September. It wasn't delivered on 3rd so EE said it would be delivered on 4th, it then wasn't delivered on 4th Sept and EE said it would possibly be delivered on 5th September. This was over a week from my initial order and was not acceptable. I hadn't received any contact from EE about the delays, it was me chasing up. I cancelled the second order over the phone with a team leader. EE said they would recall the phone and cancel the contract.\"",
    "created_at": "\"2018-09-04 12:22:05\"",
    "service_id": "218",
    "category_id": "770"
  },
  {
    "text": "\"I took out a mobile phone and tablet contract in store two days later I return both items and cancel the contract in store unfortunately direct debits was still being taken out of my bank account but I was refunded and told to cancel any more direct debits coming out of my account and yesterday I have overdue payments email and now a blip on my credit score. This problem started back on May 22nd 2018 after many many promises emails and phone calls I'm still in the same situation which is causing me unnecessary stress and now a problem with credit rating so I am not happy\"",
    "created_at": "\"2018-09-04 15:43:33\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"i have lost my mobile and would like to be sent a different phone to my adress i have no way of phoning and i cant find my phone \"",
    "created_at": "\"2018-08-22 11:40:17\"",
    "service_id": "620",
    "category_id": "249"
  },
  {
    "text": "\"I have overcharge that call i have not make any and bill is extra i have not make any call with this number help me with this extra bill pls that number i dont even know \"",
    "created_at": "\"2018-08-25 14:40:37\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"Unable to use browser with message 'Server certificate certificate of issuer is not found'. Unline chat unable to resolve. Rang customer services, waited in queue for 15 mins and then agent rung off. Rang customer services again and the agent sent messages to reset. Didn't work. Rang again. Agent said I was on old tarriff and updated it increasing call charges and said this would fix things. It didn't. Agent spoke to guru who said it was due to high activity at local mast!! Told to try again at 2100 hours. They are closed and browser still not working. 3G icon turns red and connection failure message appears. This has taken 3+ hours. Most disappointed. It occurred on: 1 Sept 2018\"",
    "created_at": "\"2018-09-01 20:47:56\"",
    "service_id": "15708",
    "category_id": "70"
  },
  {
    "text": "\"I noticed my bill was going up every month so I looked at my statement and I had lots of unauthorized charges going to my O2 account from a 3rd party (SB7 Mobile LTD) from last October 2017. When I found out in June I rang 02 who told me I had to take it up with SB7 Mobile ltd so I rang them and they say they will not refund anything and I need to speak to O2. I rang back O2 who said they were going to ring me back - after waiting a few weeks I rang them back and they said they will refund the unauthorized payments added to my account as I had not requested this and they will put a bolt on my account to stop this happening again in the future. They said that the money will be taken off my future bills until the money has been credited to me. So I have waited 2 months and today I get a bill and nothing has been credited to me. I rang 02 to explain that I have not been credited and then the agent says the system is down after he spoken to his agent. I am getting sick of this now as O2 are now helping me in any way - I feel they are not being compliant with me so I feel as though I have no other choice but to make a complaint. I would like also like to see their phone records from me as I have made a lot of calls about this but also spent a lot of time on calls about this which is unacceptable as a loyal O2 customer. \"",
    "created_at": "\"2018-08-23 11:40:20\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"keep going over on my data their for extra cost are added on to my bill each month..my bill is ment to be 12 pounds a month and im getting charge extra \"",
    "created_at": "\"2018-08-28 23:50:49\"",
    "service_id": "51870",
    "category_id": "63"
  },
  {
    "text": "\"On Saturday 1st September, I ordered (by phone) a Samsung Galaxy J3 as an upgrade to replace my lost Windows Phone. I was assured that the Samsung phone would be delivered on 3rd September. It did not arrive. I phoned Virgin Mobile several times during the week, only to be told there were 'problems' - but no further information was given. Similarly, yesterday I spoke to a man who assured me he would phone me back today. He did not, despite the fact that I told him I urgently needed the pone as I am due to go into hospital very soon\"",
    "created_at": "\"2018-09-07 21:40:04\"",
    "service_id": "51870",
    "category_id": "770"
  },
  {
    "text": "\"I would like o2 to look into my account as I think that I was over charged on my last device. As I am pretty sure that although the 24 month contract was finished, I was still charged the same amount until I went and got my new device in September 16. If this is the case, I would like the over payment to be refunded. \"",
    "created_at": "\"2018-09-02 17:34:23\"",
    "service_id": "399",
    "category_id": "249"
  },
  {
    "text": "\"I have been a customer of O2 for many years. I updgraded my phone and tariff in January 2018. At the time I complained about poor service. Was told it was due to a mast being down but would be fixed shortly. Decided to rely on that information and renewed contract/upgraded. Fast forward to now. Its still not fixed. I have limited if not existent coverage and quality at home. I pay a lot of money for a service not received. I would not have renewed if I had not been promised the fix. I pay full price per month for no service to speak of. Each time I bring this up the fix is in progress. 9 months!!!! This is not reasonable and in that time I pay full price for device and handset. I have and am paying for a service not received and there appears to be no solution. I am in a contract to Januray 2020 that, through no fault of myself does not deliver. I have been fair and patient but do not get a firm solution hence using Resolver.\"",
    "created_at": "\"2018-09-09 11:38:40\"",
    "service_id": "399",
    "category_id": "69"
  },
  {
    "text": "\"I currently have a contract which supplies 45 gb of data, 5000 minutes and unlimited text messages with data rollover. However, I have noticed that I am using approximately 20gb of data but at the end of the month only and additional 20gb of data is only rolled over. Could you please please explain as to why only 20 gb is rolled over and not the full amount of unused data.\"",
    "created_at": "\"2018-08-30 16:14:27\"",
    "service_id": "51870",
    "category_id": "72"
  },
  {
    "text": "\"Phone went dead and doesn't respond. Was promised a jiffy bag to return for repair. This was supposed to arrive last week but still nothing. \"",
    "created_at": "\"2018-09-06 10:54:36\"",
    "service_id": "51870",
    "category_id": "67"
  },
  {
    "text": "\"Bought a Nokia 3 in February, returned it for repair in July as it takes 24 hours plus to charge. Clearly a faulty phone. Was misinformed that I could get a replacement phone after second repair, only to be told it had to go back for a third repair. Repair service is disgraceful as it came back worse than before-see attached letter. I wasn't given a replacement phone to use from the hop and have to use my old Nokia phone which is not an Android. I have been paying my monthly bills for an Android phone but have not had access to the additional services and apps!\"",
    "created_at": "\"2018-08-30 12:07:13\"",
    "service_id": "399",
    "category_id": "770"
  },
  {
    "text": "\"I tried to order a phone from you on the order number mentioned above (Account Number), The order was paused while you did more checks and you emailed me saying I needed to tell you more. The link to the email didn't work and when I logged in my status say's order paused and you will be in contact. It has now been 4 days and I haven't heard anything\"",
    "created_at": "\"2018-09-06 18:48:12\"",
    "service_id": "51870",
    "category_id": "249"
  },
  {
    "text": "\"I recently went on a day trip to France and Belgium and before leaving, I checked with O2 to see if my phone would work abroad. It said on their app that my phone would work as usual and that I didn't need to do anything. As we arrived in France, I received a text stating the same thing. I was able to send texts okay, but when I tried to make phone calls and use my mobile data, it was impossible. I tried many different things, but nothing worked. It had a negative effect on our trip as I couldn't research any of the places we wanted to visit. I contacted O2 when I was back in England and I was given different excuses as to why my network wasn't working properly, such as it depends on the phone or the contract you have, or that you need to get a bolt-on before going abroad. However, this is complete false advertisement and mis-selling on O2's behalf because on their app and on the text they sent me, they stated that I needn't do anything and that my phone would work as usual! It was strange how my texts were working just fine, but nothing else! I made a complaint and was told that they'd get back to me in 24 hours, but I've heard nothing since. If they can't meet the service as stated, they need to give people compensation.\"",
    "created_at": "\"2018-09-02 16:46:28\"",
    "service_id": "399",
    "category_id": "68"
  },
  {
    "text": "\"I got my account cut off with no warning on 26/08/2018 when i called i was told that my account is under investigation due to a lot of text messages in 1 day (i got unlimited plan and never there is any issue with this) so i explained to the Representative that i made a party and have invited my friends to it so she told me that someone will call me back within 3 hours next day no body called me so i called back the representative and she told me that i should await a phone call in the next 24/48 hours as for now we are far over the 48 hours they failed to call me back i asked for my PAC code and they failed to provide me this either. \"",
    "created_at": "\"2018-08-29 16:54:46\"",
    "service_id": "51870",
    "category_id": "249"
  },
  {
    "text": "\"I have 2 paymonthly phones with yourselfs and Plusnet payas you go and the signal used to be very good near a year ago and I can only get 3G internet the odd time I get 4g I never get more than 2 signal bars.\"",
    "created_at": "\"2018-09-09 10:03:06\"",
    "service_id": "218",
    "category_id": "69"
  },
  {
    "text": "\"I recharged my sim 15 pounds for getting free international calls to India .Buy after one day I am not able to make calls to India .please solve this problem .\"",
    "created_at": "\"2018-08-28 10:42:16\"",
    "service_id": "332",
    "category_id": "72"
  },
  {
    "text": "\"I had a bill to pay I know that I was late paying the bill but when I paid the bill I got a message that my services are back to normal so i tried to call someone and it says I need to top up but it's a contract phone\"",
    "created_at": "\"2018-09-08 15:07:51\"",
    "service_id": "620",
    "category_id": "67"
  },
  {
    "text": "\"Ipad Air has stopped working without any warnings or damage. report from Apple attached stats no damage to the devise this is down to a fault and is now subject to a claim under consumer law, as the device is with the 6 year mark. Under UK consumer law, a product should be as described, fit for purpose and of reasonable quality. The liability for a faulty product is potentially up to six years although after 6-months the responsibility to prove the fault is not wear and tear becomes the responsibility of the consumer and not the seller. If you have been sold the phone as part of a 18 or 24 month agreement then you could argue the phone should be able to last the length of the agreement. Manufacturer warranty If the retailer says the product is outside of its guarantee but there is a manufacturer warranty, it might ask you to contact the manufacturer directly. However, your contract is with the retailer and not the manufacturer: it is therefore the retailer's responsibility to resolve and rectify the issue. \"",
    "created_at": "\"2018-08-28 11:04:18\"",
    "service_id": "620",
    "category_id": "67"
  },
  {
    "text": "\"I decided to move the 3 mobile phone contracts that I have with TalkTalk to another provider. I requested 3 PAC codes, which arrived. I was able to switch my 2 children's phones no problem, but for some reason my handset rejected the SIM saying my phone was locked to another network. I couldn't understand why, as the phone is mine, it is an iPhone 6, exactly the same as my children. After some time, I wondered if it was an issue with TalkTalk. When I contacted them, they told me that as my contract had originally been a 'handset' contract rather than 'sim only', my handset (which wasn't theirs) was locked to their network. Firstly, I was annoyed that when I requested the PAC codes, they didn't tell me this. Then, when I contacted them on Friday 31 August, they told me it would take 3-5 days to resolve this. I contacted them again today (3 September) and went round in circles for 40 minutes with the online chat agent getting nowhere, when she told me that it would be 5 days starting from today. She originally said 10 days, until I copied out the text from the previous agent that stated 5 days. I'm really angry that my phone which is nothing to do with TalkTalk is locked to their network in the first place, I'm angry that they didn't tell me it would need to be unlocked when I requested the PAC code, and I'm angry at the lack of action to resolve this issue by TalkTalk.\"",
    "created_at": "\"2018-09-03 14:17:54\"",
    "service_id": "7337",
    "category_id": "70"
  },
  {
    "text": "\"The New Replacement SIM that I have to insert and active. 1. I did that only to find out that after trying to do an online chat and getting turned away? Two phone calls that I can make calls and send texts but not receive! I'm waiting on job interviews and unable to receive calls and texts? After explaining this to the virgin media staff. Was told two different things and but with the same script end as I'm sorry? Not good enough! I'm saying for a service that I can't use? \"",
    "created_at": "\"2018-08-28 20:39:44\"",
    "service_id": "51870",
    "category_id": "249"
  },
  {
    "text": "\"I just find out there is CCJ on my credit file and the counting court business centre said it was from capquist and from 02 mobile contracts since 2014. Just to let you know that I did not have 02 contracts and I have reported to action fraud. This is cursing me financial troubles since it what there.\"",
    "created_at": "\"2018-08-22 20:29:41\"",
    "service_id": "399",
    "category_id": "65"
  },
  {
    "text": "\"Hi all 1. The direct debit was not taken. This is very unprofessional and troubling. 2. Please makesure that you do not place a late payment on my Credit File, as this late payment is your fault. 3. I have paid but it, seems you are becoming terrible with your systems. \"",
    "created_at": "\"2018-09-04 23:14:36\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"I took out a phone with mobiles.co.uk they bteached the contract not me they owed me 180 cash back which they refused to pay\"",
    "created_at": "\"2018-09-06 17:14:07\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"I lost my mobile and requested to block the old sim and send me a new one. I received the new SIM. My Insurance requested that I provide proof of purchase including IMEI number and date of barring. I called Vodafone for this. I was send a document with the IMEI number but beside lost/stolen it had NA and beside date of barring it had NA. I called back to request a new one with the correct date, eventually I was told it would be sent out, nothing was received so I called back. Another long conversation and I eventually again I was told by a manager that it would be sent. I received it again but with NA still in the same fields mentioned above. I called again on 4th and said was promised it again but I had to wait up to 5 working days, I have already been a month without having my replacement phone so I told the agent that it needs to be by the end of today. \"",
    "created_at": "\"2018-09-05 12:07:21\"",
    "service_id": "620",
    "category_id": "71"
  },
  {
    "text": "\"I have received terrible service since joining Virgin mobile. I called in with a few weeks of starting my service at the beginning of the year. The person told me there was a fault in my area which caused problems for mobile reception in my area. To date I still suffer this problem and i cannot use my mobile phone when I at home. I work from home and therefore the service I receive is not fit for purpose. I have tried calling the virgin media customer service for my mobile issues but no one is ever helpful. Your staff always talk down to me and I don't appreciate that. I have since cancelled my direct debit at my bank as I believe I should not be paying for a service that is not fit for purpose. My contracts end in Dec 2018 but I cannot wait because this problem is affecting my ability to work and to earn a living.\"",
    "created_at": "\"2018-09-05 13:00:07\"",
    "service_id": "51870",
    "category_id": "71"
  },
  {
    "text": "\"The overseas Virgin operators have refused on four separate occasions to give me a PAC number to transfer my account. The excuses they have made are fanciful and untrue.\"",
    "created_at": "\"2018-09-03 10:15:00\"",
    "service_id": "51870",
    "category_id": "71"
  },
  {
    "text": "\"I paid for a payg top up pack once by credit card and since then you have been taking further amounts from my card without consent. I gave the phone with sim card to my brother. You are surely acting illegally by doing this. If it doesn't stop I will be contacting the ombudsman and seeking legal advice.\"",
    "created_at": "\"2018-09-09 03:29:40\"",
    "service_id": "252",
    "category_id": "249"
  },
  {
    "text": "\"I recently cancelled a contract for the aformentioned line. As I was paying insurance for the device yet have not used it for several months, I require a email statement from ID mobile showing the last use date to obtain a reimbursement from my insura ce company.\"",
    "created_at": "\"2018-08-23 16:46:29\"",
    "service_id": "20564",
    "category_id": "63"
  },
  {
    "text": "\" please can someboby from virgin England ring me tomorrow 4/9/2018 regarding my phone and tv as I have rang 789 after being told that I would and English speaking person to resolve my problem not a twit from another country how can not understand what I am saying or the phone cutting off\"",
    "created_at": "\"2018-09-03 18:05:30\"",
    "service_id": "51870",
    "category_id": "71"
  },
  {
    "text": "\"I called your customer service and wanted to give my PAC code. The guy was clueless of what this code is and eventually disconnnected me. \"",
    "created_at": "\"2018-08-23 10:37:06\"",
    "service_id": "53014",
    "category_id": "71"
  },
  {
    "text": "\"My contract expired and there was no effort made to contact me and update me. I have now received a bill of more than double my usual charge. I understand this is partly my own responsibility. However, 02 are quick to inundate you with updates on offers and deals, but won't send a simple reminder of a policy end date or any kind of warning that your next bill will be higher than normal? \"",
    "created_at": "\"2018-08-23 12:18:20\"",
    "service_id": "399",
    "category_id": "63"
  },
  {
    "text": "\"Was sold a SIM card wanted broadband SIM was sent to wrong address never received it tried to cancel SIM and am still within cancellation period only want broadband \"",
    "created_at": "\"2018-09-07 14:01:58\"",
    "service_id": "51870",
    "category_id": "63"
  },
  {
    "text": "\"Good afternoon. I took out a contract with you in December, but I cannot find any paperwork relating to the contract, so am unable to set up a account online to monitor the account.\"",
    "created_at": "\"2018-08-23 16:46:51\"",
    "service_id": "620",
    "category_id": "249"
  },
  {
    "text": "\"given incorrect advice and on another 2 occasions deliberate tactics employed to make it very difficult to obtain a sim code from the operator's. This happened on three separate occasions from 8/8/18, 18/8/18 & 21st \"",
    "created_at": "\"2018-08-22 15:49:58\"",
    "service_id": "399",
    "category_id": "249"
  },
  {
    "text": "\"I am furious - I spoke to Vodafone before I left for a fortnight trip to Cuba. I was assured that there would be absolutely no problem making or receiving calls whilst in Cuba, using the internet and sending or receiving texts. This has severely crippled me both personally and business-wise. It beggars belief that in this day and age I was given such poor advice from Vodafones representative. it now seems that it was necessary for me to get my phone 'unblocked' before I set off but this was never explained to me. I am now well into my second week here and am racking up an enormous bill on the hotel phone at $5 per minute.\"",
    "created_at": "\"2018-09-03 13:43:15\"",
    "service_id": "620",
    "category_id": "69"
  },
  {
    "text": "\"My credit kept haemorrhaging so called to find out why. Anyone knows that the poorest are using PAYG so why charge 32p per minute to a local mobile? Its outrageous and is, in effect robbery. I have run out of money till my next payday so really stuck. \"",
    "created_at": "\"2018-08-29 08:06:38\"",
    "service_id": "51870",
    "category_id": "63"
  },
  {
    "text": "\"I have received a price increase yet my contract is a very old one I only get 3g, I have never had a RPI increase in all years I have had this contract, my understanding is it old contract and never gets changed \"",
    "created_at": "\"2018-09-05 18:10:26\"",
    "service_id": "51870",
    "category_id": "63"
  },
  {
    "text": "\"Hi i text sky about getting new mobile i received text confirm my details then got text someone will be with you followed later by text we are now closing this has gone on for three days this week same texts each time disgusted iam \"",
    "created_at": "\"2018-08-25 21:03:01\"",
    "service_id": "53785",
    "category_id": "71"
  },
  {
    "text": "\"I have Just received another monthly.... email from Virgin Mobile??? \\\"Your mobile bill dated 20 August 2018\\\", As below \\\"I CLOSED this account\\\", before it even started, twice now!!\"",
    "created_at": "\"2018-08-22 12:56:44\"",
    "service_id": "51870",
    "category_id": "72"
  },
  {
    "text": "\"On a recent trip my daughter was charged data roaming without any warning that she had locked on to a ship network.\"",
    "created_at": "\"2018-09-06 16:27:07\"",
    "service_id": "20564",
    "category_id": "68"
  },
  {
    "text": "\"Mobile phone has been put in washing machine - boil wash. Log on password and security answer not known (account holder, my husband, has progressive memory loss following brain surgery and radiotherapy for a tumour). Help line will not talk to me and cannot advise how I can resolve this - one operator has hung up on me. I have the direct debit details and your e-mail dated 06/09/2018 @ 13:33\"",
    "created_at": "\"2018-09-08 14:44:50\"",
    "service_id": "51870",
    "category_id": "249"
  },
  {
    "text": "\"Sim only Mobile chares increased from approx less than 10 to 25 pounds in 1 year. Absolutely disgraceful. I had been assured that this would not happen to me again by an executive assistant to the ceo. Of ee. I have been a customer of ee for a long time. Ie years and years.\"",
    "created_at": "\"2018-08-31 23:07:31\"",
    "service_id": "218",
    "category_id": "63"
  }
]